In [156]:
import pandas as pd
import numpy as np

In [157]:
    # - 第一个：每个元素是1～4（包含）随机整数
# - 第二个：每个元素是1～3（包含）随机整数
# - 第三个：每个元素是10000～20000（包含）随机整数


# 设置随机种子，确保每次运行生成相同的随机数
np.random.seed(42)

# 创建三个不同长度为100的 Series
series1 = pd.Series(np.random.randint(1, 5, size=100))  # 生成1~4范围内的随机整数
series2 = pd.Series(np.random.randint(1, 4, size=100))  # 生成1~3范围内的随机整数
series3 = pd.Series(np.random.randint(10000, 20001, size=100))  # 生成10000~20000范围内的随机整数

In [158]:
# 利用这3个Series作为3列创建一个DataFrame。

df = pd.DataFrame(
    {
        's1': series1,
        's2': series2,
        's3': series3,
    }
)

In [159]:
## 问题3：将上面DataFrame的列名改为bedrs、bathrs和price_sqr_meter。
rename_list = {'s1': 'bedrs',
               's2': 'bathrs',
               's3': 'price_sqr_meter'}
df.rename(rename_list)

print(df.columns)

Index(['s1', 's2', 's3'], dtype='object')

In [160]:
# 利用上面3个Series作为1列创建一个DataFrame
df = pd.concat([series1, series2, series3])

print(df)

0         3
1         4
2         1
3         3
4         3
      ...
95    17158
96    17400
97    13170
98    19874
99    12255
Length: 300, dtype: int32

In [161]:
## 问题5：上面的DataFrame的index到99为止，请将其reindex为0～299。
df.reset_index(drop=True, inplace=True)
df = df.reindex(range(300))

In [162]:
import pandas as pd

# 加载数据
df = pd.read_csv('assets/Euro_2012_stats_TEAM.csv', sep=',')  # 2012欧洲杯统计数据
display(df.info())
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 35 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Team                        16 non-null     object
 1   Goals                       16 non-null     int64
 2   Shots on target             16 non-null     int64
 3   Shots off target            16 non-null     int64
 4   Shooting Accuracy           16 non-null     object
 5   % Goals-to-shots            16 non-null     object
 6   Total shots (inc. Blocked)  16 non-null     int64
 7   Hit Woodwork                16 non-null     int64
 8   Penalty goals               16 non-null     int64
 9   Penalties not scored        16 non-null     int64
 10  Headed goals                16 non-null     int64
 11  Passes                      16 non-null     int64
 12  Passes completed            16 non-null     int64
 13  Passing Accuracy            16 non-null     object
 14  Touches                     16 non-null     int64
 15  Crosses                     16 non-null     int64
 16  Dribbles                    16 non-null     int64
 17  Corners Taken               16 non-null     int64
 18  Tackles                     16 non-null     int64
 19  Clearances                  16 non-null     int64
 20  Interceptions               16 non-null     int64
 21  Clearances off line         15 non-null     float64
 22  Clean Sheets                16 non-null     int64
 23  Blocks                      16 non-null     int64
 24  Goals conceded              16 non-null     int64
 25  Saves made                  16 non-null     int64
 26  Saves-to-shots ratio        16 non-null     object
 27  Fouls Won                   16 non-null     int64
 28  Fouls Conceded              16 non-null     int64
 29  Offsides                    16 non-null     int64
 30  Yellow Cards                16 non-null     int64
 31  Red Cards                   16 non-null     int64
 32  Subs on                     16 non-null     int64
 33  Subs off                    16 non-null     int64
 34  Players Used                16 non-null     int64
dtypes: float64(1), int64(29), object(5)
memory usage: 4.5+ KB

None

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,22,88.1%,43,45,6,5,0,11,11,16
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,6,54.6%,36,51,5,6,0,11,11,19

In [163]:
## 问题1：选择Goals列显示。
print(df[['Goals']])

    Goals
0       4
1       4
2       4
3       5
4       3
5      10
6       5
7       6
8       2
9       2
10      6
11      1
12      5
13     12
14      5
15      2

In [164]:
## 问题2：多少队伍参加Euro2012？
print(f'{len(df["Team"].unique())}只队伍参加Euro2012')

16只队伍参加Euro2012

In [165]:
## 问题3：数据集中有多少列？
df.shape[0]

16

In [166]:
## 问题4：选择Team、Yellow Cards、Red Cards三列形成新的DataFrame，命名为discipline。
discipline = pd.DataFrame(
    {
        'Team': df.Team,
        'Yellow Cards': df['Yellow Cards'],
        'Red Cards': df['Red Cards']
    },
)

discipline

                   Team  Yellow Cards  Red Cards
0               Croatia             9          0
1        Czech Republic             7          0
2               Denmark             4          0
3               England             5          0
4                France             6          0
5               Germany             4          0
6                Greece             9          1
7                 Italy            16          0
8           Netherlands             5          0
9                Poland             7          1
10             Portugal            12          0
11  Republic of Ireland             6          1
12               Russia             6          0
13                Spain            11          0
14               Sweden             7          0
15              Ukraine             5          0

In [167]:
## 问题5：对discipline采用Red Cards以及Yellow Cards（先按Red Cards排再按Yellow Cards排）降序排序。

discipline.sort_values(['Red Cards', 'Yellow Cards'], ascending=False)

                   Team  Yellow Cards  Red Cards
6                Greece             9          1
9                Poland             7          1
11  Republic of Ireland             6          1
7                 Italy            16          0
10             Portugal            12          0
13                Spain            11          0
0               Croatia             9          0
1        Czech Republic             7          0
14               Sweden             7          0
4                France             6          0
12               Russia             6          0
3               England             5          0
8           Netherlands             5          0
15              Ukraine             5          0
2               Denmark             4          0
5               Germany             4          0

In [168]:
## 问题6：计算Team的平均Yellow Cards数，四舍五入保留整数。

round(df.groupby('Team')['Yellow Cards'].mean(), 0).astype('int')

Team
Croatia                 9
Czech Republic          7
Denmark                 4
England                 5
France                  6
Germany                 4
Greece                  9
Italy                  16
Netherlands             5
Poland                  7
Portugal               12
Republic of Ireland     6
Russia                  6
Spain                  11
Sweden                  7
Ukraine                 5
Name: Yellow Cards, dtype: int32

In [169]:
## 问题7：将进球超过6（goals>6）的行找出来。

df[df['Goals'] > 6]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,15,93.8%,102,83,19,11,0,17,17,18

In [170]:
print(df.sample(12))

                   Team  Goals  Shots on target  Shots off target  \
6                Greece      5                8                18
4                France      3               22                24
9                Poland      2               15                23
1        Czech Republic      4               13                18
12               Russia      5                9                31
8           Netherlands      2               12                36
10             Portugal      6               22                42
15              Ukraine      2                7                26
14               Sweden      5               17                19
11  Republic of Ireland      1                7                12
0               Croatia      4               13                12
13                Spain     12               42                33

   Shooting Accuracy % Goals-to-shots  Total shots (inc. Blocked)  \
6              30.7%            19.2%                          32
4              37.9%             6.5%                          65
9              39.4%             5.2%                          48
1              41.9%            12.9%                          39
12             22.5%            12.5%                          59
8              25.0%             4.1%                          60
10             34.3%             9.3%                          82
15             21.2%             6.0%                          38
14             47.2%            13.8%                          39
11             36.8%             5.2%                          28
0              51.9%            16.0%                          32
13             55.9%            16.0%                         100

    Hit Woodwork  Penalty goals  Penalties not scored  ...  Saves made  \
6              1              1                     1  ...          13
4              1              0                     0  ...           6
9              0              0                     0  ...           6
1              0              0                     0  ...           9
12             2              0                     0  ...          10
8              2              0                     0  ...          12
10             6              0                     0  ...          10
15             0              0                     0  ...          13
14             3              0                     0  ...           8
11             0              0                     0  ...          17
0              0              0                     0  ...          13
13             0              1                     0  ...          15

    Saves-to-shots ratio  Fouls Won Fouls Conceded  Offsides  Yellow Cards  \
6                  65.1%         67             48        12             9
4                  54.6%         36             51         5             6
9                  66.7%         48             56         3             7
1                  60.1%         53             73         8             7
12                 77.0%         34             43         4             6
8                  70.6%         35             30         3             5
10                 71.5%         73             90        10            12
15                 76.5%         48             31         4             5
14                 61.6%         35             51         7             7
11                 65.4%         43             51        11             6
0                  81.3%         41             62         2             9
13                 93.8%        102             83        19            11

    Red Cards  Subs on  Subs off  Players Used
6           1       12        12            20
4           0       11        11            19
9           1        7         7            17
1           0       11        11            19
12          0        7         7            16
8           0        7         7            15
10          0       14        14            16
15          0        9         9            18
14          0        9         9            18
11          1       10        10            17
0           0        9         9            16
13          0       17        17            18

[12 rows x 35 columns]

In [171]:
## 问题8：找出G开头Team的所有行。

df.loc[df['Team'].str.startswith('G'), :]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,10,62.6%,63,49,12,4,0,15,15,17
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,13,65.1%,67,48,12,9,1,12,12,20

In [172]:
## 问题9：选择除了最后三列以外的所有列。
df.iloc[:, :-3]

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Clean Sheets,Blocks,Goals conceded,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,0,10,3,13,81.3%,41,62,2,9,0
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,1,10,6,9,60.1%,53,73,8,7,0
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,1,10,5,10,66.7%,25,38,8,4,0
3,England,5,11,18,50.0%,17.2%,40,0,0,0,...,2,29,3,22,88.1%,43,45,6,5,0
4,France,3,22,24,37.9%,6.5%,65,1,0,0,...,1,7,5,6,54.6%,36,51,5,6,0
5,Germany,10,32,32,47.8%,15.6%,80,2,1,0,...,1,11,6,10,62.6%,63,49,12,4,0
6,Greece,5,8,18,30.7%,19.2%,32,1,1,1,...,1,23,7,13,65.1%,67,48,12,9,1
7,Italy,6,34,45,43.0%,7.5%,110,2,0,0,...,2,18,7,20,74.1%,101,89,16,16,0
8,Netherlands,2,12,36,25.0%,4.1%,60,2,0,0,...,0,9,5,12,70.6%,35,30,3,5,0
9,Poland,2,15,23,39.4%,5.2%,48,0,0,0,...,0,8,3,6,66.7%,48,56,3,7,1
10,Portugal,6,22,42,34.3%,9.3%,82,6,0,0,...,2,11,4,10,71.5%,73,90,10,12,0
11,Republic of Ireland,1,7,12,36.8%,5.2%,28,0,0,0,...,0,23,9,17,65.4%,43,51,11,6,1
12,Russia,5,9,31,22.5%,12.5%,59,2,0,0,...,0,8,3,10,77.0%,34,43,4,6,0
13,Spain,12,42,33,55.9%,16.0%,100,0,1,0,...,5,8,1,15,93.8%,102,83,19,11,0
14,Sweden,5,17,19,47.2%,13.8%,39,3,0,0,...,1,12,5,8,61.6%,35,51,7,7,0
15,Ukraine,2,7,26,21.2%,6.0%,38,0,0,0,...,0,4,4,13,76.5%,48,31,4,5,0

In [173]:
## 问题10：只显示England、Italy、Russia三队的Shooting Accuracy列。

df.loc[df['Team'].isin(['England', 'Italy', 'Russia']), ['Team', 'Shooting Accuracy']]

       Team Shooting Accuracy
3   England             50.0%
7     Italy             43.0%
12   Russia             22.5%

In [174]:
import pandas as pd

# 加载数据
df = pd.read_csv('assets/u.user', sep='|', index_col='user_id')  # 职业数据
display(df.info())
df.head()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

None

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [175]:
## 问题1：计算每种职业的平均年龄。

df.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [176]:
## 问题2：计算每种职业的男性占比，并从大到小排序。（难，选做）

((df[df['gender'] == 'M'].groupby('occupation').size()
  / df.groupby('occupation').size()).
 sort_values(ascending=False))

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
dtype: float64

In [177]:
## 问题3： 对于每种职业，计算最小和最大年龄。
df.groupby('occupation')['age'].agg(['min','max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

In [178]:
## 问题4：按职业、性别分组，计算平均年龄。

df.groupby(['occupation','gender'])['age'].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [179]:
## 问题5：对于每种职业，显示男女性别占比。（难，选做）

((df.groupby(['occupation','gender']).size()
  / df.groupby('occupation').size()).
 sort_values(ascending=False))

occupation     gender
doctor         M         1.000000
engineer       M         0.970149
technician     M         0.962963
retired        M         0.928571
programmer     M         0.909091
executive      M         0.906250
scientist      M         0.903226
entertainment  M         0.888889
homemaker      F         0.857143
lawyer         M         0.833333
salesman       M         0.750000
educator       M         0.726316
student        M         0.693878
healthcare     F         0.687500
other          M         0.657143
marketing      M         0.615385
writer         M         0.577778
librarian      F         0.568627
none           M         0.555556
administrator  M         0.544304
artist         M         0.535714
               F         0.464286
administrator  F         0.455696
none           F         0.444444
librarian      M         0.431373
writer         F         0.422222
marketing      F         0.384615
other          F         0.342857
healthcare     M         0.312500
student        F         0.306122
educator       F         0.273684
salesman       F         0.250000
lawyer         F         0.166667
homemaker      M         0.142857
entertainment  F         0.111111
scientist      F         0.096774
executive      F         0.093750
programmer     F         0.090909
retired        F         0.071429
technician     F         0.037037
engineer       F         0.029851
dtype: float64

In [180]:
# 计算每种职业男性和女性的人数
gender_counts = df.groupby(['occupation', 'gender']).size().unstack().fillna(0)
print(gender_counts)
# 计算每种职业的总人数
total_counts = gender_counts.sum(axis=1)

# 计算男女性别比例
gender_ratio = gender_counts.div(total_counts, axis=0)

gender_ratio

gender            F      M
occupation
administrator  36.0   43.0
artist         13.0   15.0
doctor          0.0    7.0
educator       26.0   69.0
engineer        2.0   65.0
entertainment   2.0   16.0
executive       3.0   29.0
healthcare     11.0    5.0
homemaker       6.0    1.0
lawyer          2.0   10.0
librarian      29.0   22.0
marketing      10.0   16.0
none            4.0    5.0
other          36.0   69.0
programmer      6.0   60.0
retired         1.0   13.0
salesman        3.0    9.0
scientist       3.0   28.0
student        60.0  136.0
technician      1.0   26.0
writer         19.0   26.0

gender                F         M
occupation
administrator  0.455696  0.544304
artist         0.464286  0.535714
doctor         0.000000  1.000000
educator       0.273684  0.726316
engineer       0.029851  0.970149
entertainment  0.111111  0.888889
executive      0.093750  0.906250
healthcare     0.687500  0.312500
homemaker      0.857143  0.142857
lawyer         0.166667  0.833333
librarian      0.568627  0.431373
marketing      0.384615  0.615385
none           0.444444  0.555556
other          0.342857  0.657143
programmer     0.090909  0.909091
retired        0.071429  0.928571
salesman       0.250000  0.750000
scientist      0.096774  0.903226
student        0.306122  0.693878
technician     0.037037  0.962963
writer         0.422222  0.577778

In [181]:
import pandas as pd
import numpy

# 准备数据
df = pd.read_csv('assets/student-mat.csv') #美国学生饮酒消费数据 
display(df.info())
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 33 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   school      395 non-null    object
 1   sex         395 non-null    object
 2   age         395 non-null    int64
 3   address     395 non-null    object
 4   famsize     395 non-null    object
 5   Pstatus     395 non-null    object
 6   Medu        395 non-null    int64
 7   Fedu        395 non-null    int64
 8   Mjob        395 non-null    object
 9   Fjob        395 non-null    object
 10  reason      395 non-null    object
 11  guardian    395 non-null    object
 12  traveltime  395 non-null    int64
 13  studytime   395 non-null    int64
 14  failures    395 non-null    int64
 15  schoolsup   395 non-null    object
 16  famsup      395 non-null    object
 17  paid        395 non-null    object
 18  activities  395 non-null    object
 19  nursery     395 non-null    object
 20  higher      395 non-null    object
 21  internet    395 non-null    object
 22  romantic    395 non-null    object
 23  famrel      395 non-null    int64
 24  freetime    395 non-null    int64
 25  goout       395 non-null    int64
 26  Dalc        395 non-null    int64
 27  Walc        395 non-null    int64
 28  health      395 non-null    int64
 29  absences    395 non-null    int64
 30  G1          395 non-null    int64
 31  G2          395 non-null    int64
 32  G3          395 non-null    int64
dtypes: int64(16), object(17)
memory usage: 102.0+ KB

None

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

In [182]:
## 问题1：切片列school到列guardian。

df.loc[:,'school':'guardian']

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father
...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,course,other
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother
392,MS,M,21,R,GT3,T,1,1,other,other,course,other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father

In [183]:
## 问题2：创建lambda函数用于将字符串首字母大写，并应用到Mjob和Fjob列数据。

df['Mjob'].apply(lambda x:str(x).capitalize())
df['Fjob'].apply(lambda x:str(x).capitalize())

0       Teacher
1         Other
2         Other
3      Services
4         Other
         ...
390    Services
391    Services
392       Other
393       Other
394     At_home
Name: Fjob, Length: 395, dtype: object

In [184]:

## 问题3：创建函数is_legal()，并应用到数据集，返回一个新列legal_drinker，列元素值为布尔类型，True表示学生年龄大于等于17（合法饮酒），False表示小于17（不合法饮酒）。

def is_legal(age):
    return age >= 17

# 应用函数到数据集创建新列legal_drinker
df['legal_drinker'] = df['age'].apply(is_legal)

df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3,legal_drinker
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,3,4,1,1,3,6,5,6,6,True
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,3,3,1,1,3,4,5,5,6,True
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,2,2,3,3,10,7,8,10,False
3,GP,F,15,U,GT3,T,4,2,health,services,...,2,2,1,1,5,2,15,14,15,False
4,GP,F,16,U,GT3,T,3,3,other,other,...,3,2,1,2,5,4,6,10,10,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,4,4,5,4,11,9,9,9,True
391,MS,M,17,U,LE3,T,3,1,services,services,...,4,5,3,4,2,3,14,16,16,True
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,3,3,3,3,3,10,8,7,True
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,1,3,4,5,0,11,12,10,True
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,2,3,3,3,5,5,8,9,9,True

In [185]:
print(df)

    school sex  age address famsize Pstatus  Medu  Fedu      Mjob      Fjob  \
0       GP   F   18       U     GT3       A     4     4   at_home   teacher
1       GP   F   17       U     GT3       T     1     1   at_home     other
2       GP   F   15       U     LE3       T     1     1   at_home     other
3       GP   F   15       U     GT3       T     4     2    health  services
4       GP   F   16       U     GT3       T     3     3     other     other
..     ...  ..  ...     ...     ...     ...   ...   ...       ...       ...
390     MS   M   20       U     LE3       A     2     2  services  services
391     MS   M   17       U     LE3       T     3     1  services  services
392     MS   M   21       R     GT3       T     1     1     other     other
393     MS   M   18       R     LE3       T     3     2  services     other
394     MS   M   19       U     LE3       T     1     1     other   at_home

     ... freetime goout  Dalc  Walc  health absences  G1  G2  G3 legal_drinker
0    ...        3     4     1     1       3        6   5   6   6          True
1    ...        3     3     1     1       3        4   5   5   6          True
2    ...        3     2     2     3       3       10   7   8  10         False
3    ...        2     2     1     1       5        2  15  14  15         False
4    ...        3     2     1     2       5        4   6  10  10         False
..   ...      ...   ...   ...   ...     ...      ...  ..  ..  ..           ...
390  ...        5     4     4     5       4       11   9   9   9          True
391  ...        4     5     3     4       2        3  14  16  16          True
392  ...        5     3     3     3       3        3  10   8   7          True
393  ...        4     1     3     4       5        0  11  12  10          True
394  ...        2     3     3     3       5        5   8   9   9          True

[395 rows x 34 columns]

In [186]:
import pandas as pd

# 加载数据
df = pd.read_csv('assets/US_Baby_Names_right.csv') #婴儿名字数据
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [187]:
## 问题1：删除列'Unnamed: 0' 和 'Id'。

df.drop(['Unnamed: 0','Id'],axis=1,inplace=True)
df

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [188]:
## 问题2：男孩和女孩的总数是多少？

df.groupby('Gender').agg({'Count':'count'})

         Count
Gender
F       558846
M       457549

In [189]:
## 问题3：将数据按照Name分组统计出现数量，并按照降序排列。

df.groupby('Name')['Count'].sum().sort_values(ascending=False)

Name
Jacob         242874
Emma          214852
Michael       214405
Ethan         209277
Isabella      204798
               ...
Eniola             5
Atlantis           5
Marci              5
Simarpreet         5
Nita               5
Name: Count, Length: 17632, dtype: int64

In [190]:
## 问题4：数据集中有多少不同名字？

print(f"数据集中有{len(df['Name'].unique().tolist())}个不同的名字")

数据集中有17632个不同的名字

In [191]:
## 问题5： 出现频率最多和最少的名字是（可能数量不唯一，按排序结果）？

name_count_df = df.groupby('Name')['Count'].sum().sort_values(ascending=False).iloc[[0,-1]]
name_count_df['出现频率'] = ['max','min']
name_count_df

Name
Jacob        242874
Nita              5
出现频率     [max, min]
Name: Count, dtype: object

In [192]:
name_count_df = df.groupby('Name')['Count'].sum().sort_values(ascending=False).iloc[[0,-1]].to_frame().reset_index()
name_count_df['出现频率'] = ['max', 'min']

name_count_df

    Name   Count 出现频率
0  Jacob  242874  max
1   Nita       5  min

In [210]:
name_count_df = (df.groupby('Name')['Count'].count().reset_index())

max_count = name_count_df['Count'].max()
min_count = name_count_df['Count'].min()

# 找到最大值和最小值对应的Name
max_names = name_count_df.loc[name_count_df['Count'] == max_count, 'Name'].tolist()
min_names = name_count_df.loc[name_count_df['Count'] == min_count, 'Name'].tolist()

print(f"最大值为：{max_count}, 对应的Name有：{', '.join(max_names)}")
print(f"最小值为：{min_count}, 对应的Name有：{', '.join(min_names)}")

最大值为：1112, 对应的Name有：Riley